neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_unicommuart.h
/*
 * Copyright (c) 2024, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * *  Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 *
 * *  Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in the
 *    documentation and/or other materials provided with the distribution.
 *
 * *  Neither the name of Texas Instruments Incorporated nor the names of
 *    its contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 * THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 * PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR
 * CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL,
 * EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS;
 * OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR
 * OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
/*!****************************************************************************
 *  @file       dl_unicommuart.h
 *  @brief      Unified Communication Module (UNICOMM) - Universal Asynchronous Receiver/Transmitter (UART) Driver Library
 *  @defgroup   UNICOMMUART Unified Communication Module (UNICOMM) - Universal Asynchronous Receiver/Transmitter (UART)
 *
 *  @anchor ti_dl_dl_m0p_unicommuart_Overview
 *  # Overview
 *
 *  The Unified Communication Module Universal Asynchronous Receiver/Transmitter
 *  Driver Library allows full configuration of the UNICOMM UART module.
 *
 *  This Universal Asynchronous Receiver/Transmitter (UART) module provides a standardized
 *  interface to transfer data between devices and other external devices with
 *  an asynchronous serial communication protocol like LIN (local interconnection
 *  network), ISO7816 (Smart card protocol), IrDA (infrared data association),
 *  hardware flow control (CTS/RTS) and multiprocessor communications.
 *
 *  <hr>
 ******************************************************************************
 */
/** @addtogroup UNICOMMUART
 * @{
 */
#ifndef ti_dl_dl_unicommuart__include
#define ti_dl_dl_unicommuart__include

#include <stdbool.h>
#include <stdint.h>

#include <inc/msp.h>
#include <driverlib/dl_common.h>
#include <driverlib/dl_unicomm.h>

#ifdef __MCU_HAS_UNICOMMUART__

#ifdef __cplusplus
extern "C" {
#endif

/* clang-format off */

/** @addtogroup DL_UART_EXTEND_MACROS
 *  Macros to retain compatibility with standalone dl_uart_extend APIs
 *  @{
 */
/*! Redirects to @ref DL_UART_INTERRUPT_DMA_DONE_TX */
#define DL_UART_EXTEND_INTERRUPT_DMA_DONE_TX            DL_UART_INTERRUPT_DMA_DONE_TX
/*! Redirects to @ref DL_UART_INTERRUPT_DMA_DONE_RX */
#define DL_UART_EXTEND_INTERRUPT_DMA_DONE_RX            DL_UART_INTERRUPT_DMA_DONE_RX
/*! Redirects to @ref DL_UART_INTERRUPT_CTS_DONE */
#define DL_UART_EXTEND_INTERRUPT_CTS_DONE               DL_UART_INTERRUPT_CTS_DONE
/*! Redirects to @ref DL_UART_INTERRUPT_ADDRESS_MATCH */
#define DL_UART_EXTEND_INTERRUPT_ADDRESS_MATCH          DL_UART_INTERRUPT_ADDRESS_MATCH
/*! Redirects to @ref DL_UART_INTERRUPT_LINC0_MATCH */
#define DL_UART_EXTEND_INTERRUPT_LINC0_MATCH            DL_UART_INTERRUPT_LINC0_MATCH
/*! Redirects to @ref DL_UART_INTERRUPT_EOT_DONE */
#define DL_UART_EXTEND_INTERRUPT_EOT_DONE               DL_UART_INTERRUPT_EOT_DONE
/*! Redirects to @ref DL_UART_INTERRUPT_TX */
#define DL_UART_EXTEND_INTERRUPT_TX                     DL_UART_INTERRUPT_TX
/*! Redirects to @ref DL_UART_INTERRUPT_RX */
#define DL_UART_EXTEND_INTERRUPT_RX                     DL_UART_INTERRUPT_RX
/*! Redirects to @ref DL_UART_INTERRUPT_LIN_RISING_EDGE */
#define DL_UART_EXTEND_INTERRUPT_LIN_RISING_EDGE        DL_UART_INTERRUPT_LIN_RISING_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_LIN_FALLING_EDGE */
#define DL_UART_EXTEND_INTERRUPT_LIN_FALLING_EDGE       DL_UART_INTERRUPT_LIN_FALLING_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_RXD_POS_EDGE */
#define DL_UART_EXTEND_INTERRUPT_RXD_POS_EDGE           DL_UART_INTERRUPT_RXD_POS_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_RXD_NEG_EDGE */
#define DL_UART_EXTEND_INTERRUPT_RXD_NEG_EDGE           DL_UART_INTERRUPT_RXD_NEG_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_OVERRUN_ERROR */
#define DL_UART_EXTEND_INTERRUPT_OVERRUN_ERROR          DL_UART_INTERRUPT_OVERRUN_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_BREAK_ERROR */
#define DL_UART_EXTEND_INTERRUPT_BREAK_ERROR            DL_UART_INTERRUPT_BREAK_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_PARITY_ERROR */
#define DL_UART_EXTEND_INTERRUPT_PARITY_ERROR           DL_UART_INTERRUPT_PARITY_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_FRAMING_ERROR */
#define DL_UART_EXTEND_INTERRUPT_FRAMING_ERROR          DL_UART_INTERRUPT_FRAMING_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_RX_TIMEOUT_ERROR */
#define DL_UART_EXTEND_INTERRUPT_RX_TIMEOUT_ERROR       DL_UART_INTERRUPT_RX_TIMEOUT_ERROR
/*! Redirects to @ref DL_UART_INTERRUPT_NOISE_ERROR */
#define DL_UART_EXTEND_INTERRUPT_NOISE_ERROR            DL_UART_INTERRUPT_NOISE_ERROR
/*! Redirects to @ref DL_UART_IIDX_DMA_DONE_TX */
#define DL_UART_EXTEND_IIDX_DMA_DONE_TX                 DL_UART_IIDX_DMA_DONE_TX
/*! Redirects to @ref DL_UART_IIDX_DMA_DONE_RX */
#define DL_UART_EXTEND_IIDX_DMA_DONE_RX                 DL_UART_IIDX_DMA_DONE_RX
/*! Redirects to @ref DL_UART_IIDX_CTS_DONE */
#define DL_UART_EXTEND_IIDX_CTS_DONE                    DL_UART_IIDX_CTS_DONE
/*! Redirects to @ref DL_UART_IIDX_EOT_DONE */
#define DL_UART_EXTEND_IIDX_EOT_DONE                    DL_UART_IIDX_EOT_DONE
/*! Redirects to @ref DL_UART_IIDX_TX */
#define DL_UART_EXTEND_IIDX_TX                          DL_UART_IIDX_TX
/*! Redirects to @ref DL_UART_IIDX_RX */
#define DL_UART_EXTEND_IIDX_RX                          DL_UART_IIDX_RX
/*! Redirects to @ref DL_UART_IIDX_LIN_COUNTER_OVERFLOW */
#define DL_UART_EXTEND_IIDX_LIN_COUNTER_OVERFLOW        DL_UART_IIDX_LIN_COUNTER_OVERFLOW
/*! Redirects to @ref DL_UART_IIDX_LIN_RISING_EDGE */
#define DL_UART_EXTEND_IIDX_LIN_RISING_EDGE             DL_UART_IIDX_LIN_RISING_EDGE
/*! Redirects to @ref DL_UART_IIDX_LIN_FALLING_EDGE */
#define DL_UART_EXTEND_IIDX_LIN_FALLING_EDGE            DL_UART_IIDX_LIN_FALLING_EDGE
/*! Redirects to @ref DL_UART_IIDX_RXD_POS_EDGE */
#define DL_UART_EXTEND_IIDX_RXD_POS_EDGE                DL_UART_IIDX_RXD_POS_EDGE
/*! Redirects to @ref DL_UART_IIDX_RXD_NEG_EDGE */
#define DL_UART_EXTEND_IIDX_RXD_NEG_EDGE                DL_UART_IIDX_RXD_NEG_EDGE
/*! Redirects to @ref DL_UART_IIDX_OVERRUN_ERROR */
#define DL_UART_EXTEND_IIDX_OVERRUN_ERROR               DL_UART_IIDX_OVERRUN_ERROR
/*! Redirects to @ref DL_UART_IIDX_BREAK_ERROR */
#define DL_UART_EXTEND_IIDX_BREAK_ERROR                 DL_UART_IIDX_BREAK_ERROR
/*! Redirects to @ref DL_UART_IIDX_PARITY_ERROR */
#define DL_UART_EXTEND_IIDX_PARITY_ERROR                DL_UART_IIDX_PARITY_ERROR
/*! Redirects to @ref DL_UART_IIDX_FRAMING_ERROR */
#define DL_UART_EXTEND_IIDX_FRAMING_ERROR               DL_UART_IIDX_FRAMING_ERROR
/*! Redirects to @ref DL_UART_IIDX_RX_TIMEOUT_ERROR */
#define DL_UART_EXTEND_IIDX_RX_TIMEOUT_ERROR            DL_UART_IIDX_RX_TIMEOUT_ERROR
/*! Redirects to @ref DL_UART_IIDX_NOISE_ERROR */
#define DL_UART_EXTEND_IIDX_NOISE_ERROR                 DL_UART_IIDX_NOISE_ERROR
/*! Redirects to @ref DL_UART_IIDX_NO_INTERRUPT */
#define DL_UART_EXTEND_IIDX_NO_INTERRUPT                DL_UART_IIDX_NO_INTERRUPT
/*! Redirects to @ref DL_UART_DMA_INTERRUPT_RX */
#define DL_UART_EXTEND_DMA_INTERRUPT_RX                 DL_UART_DMA_INTERRUPT_RX
/*! Redirects to @ref DL_UART_DMA_INTERRUPT_RX_TIMEOUT */
#define DL_UART_EXTEND_DMA_INTERRUPT_RX_TIMEOUT         DL_UART_DMA_INTERRUPT_RX_TIMEOUT
/*! Redirects to @ref DL_UART_DMA_INTERRUPT_TX */
#define DL_UART_EXTEND_DMA_INTERRUPT_TX                 DL_UART_DMA_INTERRUPT_TX
/*! Redirects to @ref DL_UART_ERROR_BREAK */
#define DL_UART_EXTEND_ERROR_BREAK                      DL_UART_ERROR_BREAK
/*! Redirects to @ref DL_UART_ERROR_PARITY */
#define DL_UART_EXTEND_ERROR_PARITY                     DL_UART_ERROR_PARITY
/*! Redirects to @ref DL_UART_ERROR_FRAMING */
#define DL_UART_EXTEND_ERROR_FRAMING                    DL_UART_ERROR_FRAMING
/*! Redirects to @ref DL_UART_OVERSAMPLING_RATE_16X */
#define DL_UART_EXTEND_OVERSAMPLING_RATE_16X            DL_UART_OVERSAMPLING_RATE_16X
/*! Redirects to @ref DL_UART_OVERSAMPLING_RATE_8X */
#define DL_UART_EXTEND_OVERSAMPLING_RATE_8X             DL_UART_OVERSAMPLING_RATE_8X
/*! Redirects to @ref DL_UART_OVERSAMPLING_RATE_3X */
#define DL_UART_EXTEND_OVERSAMPLING_RATE_3X             DL_UART_OVERSAMPLING_RATE_3X
/*! Redirects to @ref DL_UART_PARITY_EVEN */
#define DL_UART_EXTEND_PARITY_EVEN                      DL_UART_PARITY_EVEN
/*! Redirects to @ref DL_UART_PARITY_ODD */
#define DL_UART_EXTEND_PARITY_ODD                       DL_UART_PARITY_ODD
/*! Redirects to @ref DL_UART_PARITY_STICK_ONE */
#define DL_UART_EXTEND_PARITY_STICK_ONE                 DL_UART_PARITY_STICK_ONE
/*! Redirects to @ref DL_UART_PARITY_STICK_ZERO */
#define DL_UART_EXTEND_PARITY_STICK_ZERO                DL_UART_PARITY_STICK_ZERO
/*! Redirects to @ref DL_UART_PARITY_NONE */
#define DL_UART_EXTEND_PARITY_NONE                      DL_UART_PARITY_NONE
/*! Redirects to @ref DL_UART_WORD_LENGTH_5_BITS */
#define DL_UART_EXTEND_WORD_LENGTH_5_BITS               DL_UART_WORD_LENGTH_5_BITS
/*! Redirects to @ref DL_UART_WORD_LENGTH_6_BITS */
#define DL_UART_EXTEND_WORD_LENGTH_6_BITS               DL_UART_WORD_LENGTH_6_BITS
/*! Redirects to @ref DL_UART_WORD_LENGTH_7_BITS */
#define DL_UART_EXTEND_WORD_LENGTH_7_BITS               DL_UART_WORD_LENGTH_7_BITS
/*! Redirects to @ref DL_UART_WORD_LENGTH_8_BITS */
#define DL_UART_EXTEND_WORD_LENGTH_8_BITS               DL_UART_WORD_LENGTH_8_BITS
/*! Redirects to @ref DL_UART_MODE_NORMAL */
#define DL_UART_EXTEND_MODE_NORMAL                      DL_UART_MODE_NORMAL
/*! Redirects to @ref DL_UART_MODE_RS485 */
#define DL_UART_EXTEND_MODE_RS485                       DL_UART_MODE_RS485
/*! Redirects to @ref DL_UART_MODE_IDLE_LINE */
#define DL_UART_EXTEND_MODE_IDLE_LINE                   DL_UART_MODE_IDLE_LINE
/*! Redirects to @ref DL_UART_MODE_ADDR_9_BIT */
#define DL_UART_EXTEND_MODE_ADDR_9_BIT                  DL_UART_MODE_ADDR_9_BIT
/*! Redirects to @ref DL_UART_MODE_SMART_CARD */
#define DL_UART_EXTEND_MODE_SMART_CARD                  DL_UART_MODE_SMART_CARD
/*! Redirects to @ref DL_UART_MODE_DALI */
#define DL_UART_EXTEND_MODE_DALI                        DL_UART_MODE_DALI
/*! Redirects to @ref DL_UART_DIRECTION_TX */
#define DL_UART_EXTEND_DIRECTION_TX                     DL_UART_DIRECTION_TX
/*! Redirects to @ref DL_UART_DIRECTION_RX */
#define DL_UART_EXTEND_DIRECTION_RX                     DL_UART_DIRECTION_RX
/*! Redirects to @ref DL_UART_DIRECTION_TX_RX */
#define DL_UART_EXTEND_DIRECTION_TX_RX                  DL_UART_DIRECTION_TX_RX
/*! Redirects to @ref DL_UART_DIRECTION_NONE */
#define DL_UART_EXTEND_DIRECTION_NONE                   DL_UART_DIRECTION_NONE
/*! Redirects to @ref DL_UART_CLOCK_BUSCLK */
#define DL_UART_EXTEND_CLOCK_BUSCLK                     DL_UART_CLOCK_BUSCLK
/*! Redirects to @ref DL_UART_CLOCK_MFCLK */
#define DL_UART_EXTEND_CLOCK_MFCLK                      DL_UART_CLOCK_MFCLK
/*! Redirects to @ref DL_UART_CLOCK_LFCLK */
#define DL_UART_EXTEND_CLOCK_LFCLK                      DL_UART_CLOCK_LFCLK
/*! Redirects to @ref DL_UART_FLOW_CONTROL_RTS */
#define DL_UART_EXTEND_FLOW_CONTROL_RTS                 DL_UART_FLOW_CONTROL_RTS
/*! Redirects to @ref DL_UART_FLOW_CONTROL_CTS */
#define DL_UART_EXTEND_FLOW_CONTROL_CTS                 DL_UART_FLOW_CONTROL_CTS
/*! Redirects to @ref DL_UART_FLOW_CONTROL_RTS_CTS */
#define DL_UART_EXTEND_FLOW_CONTROL_RTS_CTS             DL_UART_FLOW_CONTROL_RTS_CTS
/*! Redirects to @ref DL_UART_FLOW_CONTROL_NONE */
#define DL_UART_EXTEND_FLOW_CONTROL_NONE                DL_UART_FLOW_CONTROL_NONE
/*! Redirects to @ref DL_UART_RTS_ASSERT */
#define DL_UART_EXTEND_RTS_ASSERT                       DL_UART_RTS_ASSERT
/*! Redirects to @ref DL_UART_RTS_DEASSERT */
#define DL_UART_EXTEND_RTS_DEASSERT                     DL_UART_RTS_DEASSERT
/*! Redirects to @ref DL_UART_STOP_BITS_ONE */
#define DL_UART_EXTEND_STOP_BITS_ONE                    DL_UART_STOP_BITS_ONE
/*! Redirects to @ref DL_UART_STOP_BITS_TWO */
#define DL_UART_EXTEND_STOP_BITS_TWO                    DL_UART_STOP_BITS_TWO
/*! Redirects to @ref DL_UART_TXD_OUT_LOW */
#define DL_UART_EXTEND_TXD_OUT_LOW                      DL_UART_TXD_OUT_LOW
/*! Redirects to @ref DL_UART_TXD_OUT_HIGH */
#define DL_UART_EXTEND_TXD_OUT_HIGH                     DL_UART_TXD_OUT_HIGH
/*! Redirects to @ref DL_UART_TX_FIFO_LEVEL_3_4_EMPTY */
#define DL_UART_EXTEND_TX_FIFO_LEVEL_3_4_EMPTY          DL_UART_TX_FIFO_LEVEL_3_4_EMPTY
/*! Redirects to @ref DL_UART_TX_FIFO_LEVEL_1_4_EMPTY */
#define DL_UART_EXTEND_TX_FIFO_LEVEL_1_4_EMPTY          DL_UART_TX_FIFO_LEVEL_1_4_EMPTY
/*! Redirects to @ref DL_UART_TX_FIFO_LEVEL_EMPTY */
#define DL_UART_EXTEND_TX_FIFO_LEVEL_EMPTY              DL_UART_TX_FIFO_LEVEL_EMPTY
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_FULL */
#define DL_UART_EXTEND_RX_FIFO_LEVEL_FULL               DL_UART_RX_FIFO_LEVEL_FULL
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_3_4_FULL */
#define DL_UART_EXTEND_RX_FIFO_LEVEL_3_4_FULL           DL_UART_RX_FIFO_LEVEL_3_4_FULL
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_1_2_FULL */
#define DL_UART_EXTEND_RX_FIFO_LEVEL_1_2_FULL           DL_UART_RX_FIFO_LEVEL_1_2_FULL
/*! Redirects to @ref DL_UART_RX_FIFO_LEVEL_1_4_FULL */
#define DL_UART_EXTEND_RX_FIFO_LEVEL_1_4_FULL           DL_UART_RX_FIFO_LEVEL_1_4_FULL
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_1 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_1             DL_UART_CLOCK_DIVIDE_RATIO_1
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_2 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_2             DL_UART_CLOCK_DIVIDE_RATIO_2
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_3 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_3             DL_UART_CLOCK_DIVIDE_RATIO_3
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_4 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_4             DL_UART_CLOCK_DIVIDE_RATIO_4
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_5 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_5             DL_UART_CLOCK_DIVIDE_RATIO_5
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_6 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_6             DL_UART_CLOCK_DIVIDE_RATIO_6
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_7 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_7             DL_UART_CLOCK_DIVIDE_RATIO_7
/*! Redirects to @ref DL_UART_CLOCK_DIVIDE_RATIO_8 */
#define DL_UART_EXTEND_CLOCK_DIVIDE_RATIO_8             DL_UART_CLOCK_DIVIDE_RATIO_8
/*! Redirects to @ref DL_UART_INTERRUPT_LIN_COUNTER_OVERFLOW */
#define DL_UART_EXTEND_INTERRUPT_LIN_COUNTER_OVERFLOW   DL_UART_INTERRUPT_LIN_COUNTER_OVERFLOW
/*! Redirects to @ref DL_UART_INTERRUPT_LIN_RISING_EDGE */
#define DL_UART_EXTEND_INTERRUPT_LIN_RISING_EDGE        DL_UART_INTERRUPT_LIN_RISING_EDGE
/*! Redirects to @ref DL_UART_INTERRUPT_LIN_FALLING_EDGE */
#define DL_UART_EXTEND_INTERRUPT_LIN_FALLING_EDGE       DL_UART_INTERRUPT_LIN_FALLING_EDGE
/*! Redirects to @ref DL_UART_IRDA_CLOCK_BAUD_RATE */
#define DL_UART_EXTEND_IRDA_CLOCK_BAUD_RATE             DL_UART_IRDA_CLOCK_BAUD_RATE
/*! Redirects to @ref DL_UART_IRDA_CLOCK_FUNCTIONAL */
#define DL_UART_EXTEND_IRDA_CLOCK_FUNCTIONAL            DL_UART_IRDA_CLOCK_FUNCTIONAL
/*! Redirects to @ref DL_UART_IRDA_POLARITY_LOW */
#define DL_UART_EXTEND_IRDA_POLARITY_LOW                DL_UART_IRDA_POLARITY_LOW
/*! Redirects to @ref DL_UART_IRDA_POLARITY_HIGH */
#define DL_UART_EXTEND_IRDA_POLARITY_HIGH               DL_UART_IRDA_POLARITY_HIGH
/*! Redirects to @ref DL_UART_PULSE_WIDTH_3_16_BIT_PERIOD */
#define DL_UART_EXTEND_PULSE_WIDTH_3_16_BIT_PERIOD      DL_UART_PULSE_WIDTH_3_16_BIT_PERIOD
/*! Redirects to @ref DL_UART_Config */
#define DL_UART_Extend_Config                           DL_UART_Config
/*! Redirects to @ref DL_UART_ClockConfig */
#define DL_UART_Extend_ClockConfig                      DL_UART_ClockConfig
/*! Redirects to @ref DL_UART_init */
#define DL_UART_Extend_init                             DL_UART_init
/*! Redirects to @ref DL_UART_enablePower */
#define DL_UART_Extend_enablePower                      DL_UART_enablePower
/*! Redirects to @ref DL_UART_disablePower */
#define DL_UART_Extend_disablePower                     DL_UART_disablePower
/*! Redirects to @ref DL_UART_isPowerEnabled */
#define DL_UART_Extend_isPowerEnabled                   DL_UART_isPowerEnabled
/*! Redirects to @ref DL_UART_reset */
#define DL_UART_Extend_reset                            DL_UART_reset
/*! Redirects to @ref DL_UART_enable */
#define DL_UART_Extend_enable                           DL_UART_enable
/*! Redirects to @ref DL_UART_isEnabled */
#define DL_UART_Extend_isEnabled                        DL_UART_isEnabled
/*! Redirects to @ref DL_UART_disable */
#define DL_UART_Extend_disable                          DL_UART_disable
/*! Redirects to @ref DL_UART_setClockConfig */
#define DL_UART_Extend_setClockConfig                   DL_UART_setClockConfig
/*! Redirects to @ref DL_UART_getClockConfig */
#define DL_UART_Extend_getClockConfig                   DL_UART_getClockConfig
/*! Redirects to @ref DL_UART_configBaudRate */
#define DL_UART_Extend_configBaudRate                   DL_UART_configBaudRate
/*! Redirects to @ref DL_UART_setOversampling */
#define DL_UART_Extend_setOversampling                  DL_UART_setOversampling
/*! Redirects to @ref DL_UART_getOversampling */
#define DL_UART_Extend_getOversampling                  DL_UART_getOversampling
/*! Redirects to @ref DL_UART_enableLoopbackMode */
#define DL_UART_Extend_enableLoopbackMode               DL_UART_enableLoopbackMode
/*! Redirects to @ref DL_UART_isLoopbackModeEnabled */
#define DL_UART_Extend_isLoopbackModeEnabled            DL_UART_isLoopbackModeEnabled
/*! Redirects to @ref DL_UART_disableLoopbackMode */
#define DL_UART_Extend_disableLoopbackMode              DL_UART_disableLoopbackMode
/*! Redirects to @ref DL_UART_setDirection */
#define DL_UART_Extend_setDirection                     DL_UART_setDirection
/*! Redirects to @ref DL_UART_getDirection */
#define DL_UART_Extend_getDirection                     DL_UART_getDirection
/*! Redirects to @ref DL_UART_enableMajorityVoting */
#define DL_UART_Extend_enableMajorityVoting             DL_UART_enableMajorityVoting
/*! Redirects to @ref DL_UART_isMajorityVotingEnabled */
#define DL_UART_Extend_isMajorityVotingEnabled          DL_UART_isMajorityVotingEnabled
/*! Redirects to @ref DL_UART_disableMajorityVoting */
#define DL_UART_Extend_disableMajorityVoting            DL_UART_disableMajorityVoting
/*! Redirects to @ref DL_UART_enableMSBFirst */
#define DL_UART_Extend_enableMSBFirst                   DL_UART_enableMSBFirst
/*! Redirects to @ref DL_UART_isMSBFirstEnabled */
#define DL_UART_Extend_isMSBFirstEnabled                DL_UART_isMSBFirstEnabled
/*! Redirects to @ref DL_UART_disableMSBFirst */
#define DL_UART_Extend_disableMSBFirst                  DL_UART_disableMSBFirst
/*! Redirects to @ref DL_UART_enableTransmitPinManualControl */
#define DL_UART_Extend_enableTransmitPinManualControl   DL_UART_enableTransmitPinManualControl
/*! Redirects to @ref DL_UART_isTransmitPinManualControlEnabled */
#define DL_UART_Extend_isTransmitPinManualControlEnabled DL_UART_isTransmitPinManualControlEnabled
/*! Redirects to @ref DL_UART_disableTransmitPinManualControl */
#define DL_UART_Extend_disableTransmitPinManualControl   DL_UART_disableTransmitPinManualControl
/*! Redirects to @ref DL_UART_setTransmitPinManualOutput */
#define DL_UART_Extend_setTransmitPinManualOutput       DL_UART_setTransmitPinManualOutput
/*! Redirects to @ref DL_UART_getTransmitPinManualOutput */
#define DL_UART_Extend_getTransmitPinManualOutput       DL_UART_getTransmitPinManualOutput
/*! Redirects to @ref DL_UART_setCommunicationMode */
#define DL_UART_Extend_setCommunicationMode             DL_UART_setCommunicationMode
/*! Redirects to @ref DL_UART_getCommunicationMode */
#define DL_UART_Extend_getCommunicationMode             DL_UART_getCommunicationMode
/*! Redirects to @ref DL_UART_setFlowControl */
#define DL_UART_Extend_setFlowControl                   DL_UART_setFlowControl
/*! Redirects to @ref DL_UART_getFlowControl */
#define DL_UART_Extend_getFlowControl                   DL_UART_getFlowControl
/*! Redirects to @ref DL_UART_setRTSOutput */
#define DL_UART_Extend_setRTSOutput                     DL_UART_setRTSOutput
/*! Redirects to @ref DL_UART_enableFIFOs */
#define DL_UART_Extend_enableFIFOs                      DL_UART_enableFIFOs
/*! Redirects to @ref DL_UART_disableFIFOs */
#define DL_UART_Extend_disableFIFOs                     DL_UART_disableFIFOs
/*! Redirects to @ref DL_UART_isFIFOsEnabled */
#define DL_UART_Extend_isFIFOsEnabled                   DL_UART_isFIFOsEnabled
/*! Redirects to @ref DL_UART_isParityEnabled */
#define DL_UART_Extend_isParityEnabled                  DL_UART_isParityEnabled
/*! Redirects to @ref DL_UART_setParityMode */
#define DL_UART_Extend_setParityMode                    DL_UART_setParityMode
/*! Redirects to @ref DL_UART_getParityMode */
#define DL_UART_Extend_getParityMode                    DL_UART_getParityMode
/*! Redirects to @ref DL_UART_setStopBits */
#define DL_UART_Extend_setStopBits                      DL_UART_setStopBits
/*! Redirects to @ref DL_UART_getStopBits */
#define DL_UART_Extend_getStopBits                      DL_UART_getStopBits
/*! Redirects to @ref DL_UART_setWordLength */
#define DL_UART_Extend_setWordLength                    DL_UART_setWordLength
/*! Redirects to @ref DL_UART_getWordLength */
#define DL_UART_Extend_getWordLength                    DL_UART_getWordLength
/*! Redirects to @ref DL_UART_enableSendIdlePattern */
#define DL_UART_Extend_enableSendIdlePattern            DL_UART_enableSendIdlePattern
/*! Redirects to @ref DL_UART_disableSendIdlePattern */
#define DL_UART_Extend_disableSendIdlePattern           DL_UART_disableSendIdlePattern
/*! Redirects to @ref DL_UART_isSendIdlePatternEnabled */
#define DL_UART_Extend_isSendIdlePatternEnabled         DL_UART_isSendIdlePatternEnabled
/*! Redirects to @ref DL_UART_setExternalDriverSetup */
#define DL_UART_Extend_setExternalDriverSetup           DL_UART_setExternalDriverSetup
/*! Redirects to @ref DL_UART_getExternalDriverSetup */
#define DL_UART_Extend_getExternalDriverSetup           DL_UART_getExternalDriverSetup
/*! Redirects to @ref DL_UART_setExternalDriverHold */
#define DL_UART_Extend_setExternalDriverHold            DL_UART_setExternalDriverHold
/*! Redirects to @ref DL_UART_getExternalDriverHold */
#define DL_UART_Extend_getExternalDriverHold            DL_UART_getExternalDriverHold
/*! Redirects to @ref DL_UART_isBusy */
#define DL_UART_Extend_isBusy                           DL_UART_isBusy
/*! Redirects to @ref DL_UART_isRXFIFOEmpty */
#define DL_UART_Extend_isRXFIFOEmpty                    DL_UART_isRXFIFOEmpty
/*! Redirects to @ref DL_UART_isRXFIFOFull */
#define DL_UART_Extend_isRXFIFOFull                     DL_UART_isRXFIFOFull
/*! Redirects to @ref DL_UART_isTXFIFOEmpty */
