neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_unicommuart.h
#define DL_UART_Extend_isTXFIFOEmpty                    DL_UART_isTXFIFOEmpty
/*! Redirects to @ref DL_UART_isTXFIFOFull */
#define DL_UART_Extend_isTXFIFOFull                     DL_UART_isTXFIFOFull
/*! Redirects to @ref DL_UART_isClearToSend */
#define DL_UART_Extend_isClearToSend                    DL_UART_isClearToSend
/*! Redirects to @ref DL_UART_isIdleModeDetected */
#define DL_UART_Extend_isIdleModeDetected               DL_UART_isIdleModeDetected
/*! Redirects to @ref DL_UART_setTXFIFOThreshold */
#define DL_UART_Extend_setTXFIFOThreshold               DL_UART_setTXFIFOThreshold
/*! Redirects to @ref DL_UART_getTXFIFOThreshold */
#define DL_UART_Extend_getTXFIFOThreshold               DL_UART_getTXFIFOThreshold
/*! Redirects to @ref DL_UART_setRXFIFOThreshold */
#define DL_UART_Extend_setRXFIFOThreshold               DL_UART_setRXFIFOThreshold
/*! Redirects to @ref DL_UART_getRXFIFOThreshold */
#define DL_UART_Extend_getRXFIFOThreshold               DL_UART_getRXFIFOThreshold
/*! Redirects to @ref DL_UART_setRXInterruptTimeout */
#define DL_UART_Extend_setRXInterruptTimeout            DL_UART_setRXInterruptTimeout
/*! Redirects to @ref DL_UART_getRXInterruptTimeout */
#define DL_UART_Extend_getRXInterruptTimeout            DL_UART_getRXInterruptTimeout
/*! Redirects to @ref DL_UART_getIntegerBaudRateDivisor */
#define DL_UART_Extend_getIntegerBaudRateDivisor        DL_UART_getIntegerBaudRateDivisor
/*! Redirects to @ref DL_UART_getFractionalBaudRateDivisor */
#define DL_UART_Extend_getFractionalBaudRateDivisor     DL_UART_getFractionalBaudRateDivisor
/*! Redirects to @ref DL_UART_setBaudRateDivisor */
#define DL_UART_Extend_setBaudRateDivisor               DL_UART_setBaudRateDivisor
/*! Redirects to @ref DL_UART_transmitData */
#define DL_UART_Extend_transmitData                     DL_UART_transmitData
/*! Redirects to @ref DL_UART_receiveData */
#define DL_UART_Extend_receiveData                      DL_UART_receiveData
/*! Redirects to @ref DL_UART_getErrorStatus */
#define DL_UART_Extend_getErrorStatus                   DL_UART_getErrorStatus
/*! Redirects to @ref DL_UART_enableInterrupt */
#define DL_UART_Extend_enableInterrupt                  DL_UART_enableInterrupt
/*! Redirects to @ref DL_UART_disableInterrupt */
#define DL_UART_Extend_disableInterrupt                 DL_UART_disableInterrupt
/*! Redirects to @ref DL_UART_getEnabledInterrupts */
#define DL_UART_Extend_getEnabledInterrupts             DL_UART_getEnabledInterrupts
/*! Redirects to @ref DL_UART_getEnabledInterruptStatus */
#define DL_UART_Extend_getEnabledInterruptStatus        DL_UART_getEnabledInterruptStatus
/*! Redirects to @ref DL_UART_getRawInterruptStatus */
#define DL_UART_Extend_getRawInterruptStatus            DL_UART_getRawInterruptStatus
/*! Redirects to @ref DL_UART_getPendingInterrupt */
#define DL_UART_Extend_getPendingInterrupt              DL_UART_getPendingInterrupt
/*! Redirects to @ref DL_UART_clearInterruptStatus */
#define DL_UART_Extend_clearInterruptStatus             DL_UART_clearInterruptStatus
/*! Redirects to @ref DL_UART_changeConfig */
#define DL_UART_Extend_changeConfig                     DL_UART_changeConfig
/*! Redirects to @ref DL_UART_transmitDataBlocking */
#define DL_UART_Extend_transmitDataBlocking             DL_UART_transmitDataBlocking
/*! Redirects to @ref DL_UART_receiveDataBlocking */
#define DL_UART_Extend_receiveDataBlocking              DL_UART_receiveDataBlocking
/*! Redirects to @ref DL_UART_transmitDataCheck */
#define DL_UART_Extend_transmitDataCheck                DL_UART_transmitDataCheck
/*! Redirects to @ref DL_UART_receiveDataCheck */
#define DL_UART_Extend_receiveDataCheck                 DL_UART_receiveDataCheck
/*! Redirects to @ref DL_UART_drainRXFIFO */
#define DL_UART_Extend_drainRXFIFO                      DL_UART_drainRXFIFO
/*! Redirects to @ref DL_UART_fillTXFIFO */
#define DL_UART_Extend_fillTXFIFO                       DL_UART_fillTXFIFO
/*! Redirects to @ref DL_UART_enableDMAReceiveEvent */
#define DL_UART_Extend_enableDMAReceiveEvent            DL_UART_enableDMAReceiveEvent
/*! Redirects to @ref DL_UART_enableDMATransmitEvent */
#define DL_UART_Extend_enableDMATransmitEvent           DL_UART_enableDMATransmitEvent
/*! Redirects to @ref DL_UART_disableDMAReceiveEvent */
#define DL_UART_Extend_disableDMAReceiveEvent           DL_UART_disableDMAReceiveEvent
/*! Redirects to @ref DL_UART_disableDMATransmitEvent */
#define DL_UART_Extend_disableDMATransmitEvent          DL_UART_disableDMATransmitEvent
/*! Redirects to @ref DL_UART_getEnabledDMAReceiveEvent */
#define DL_UART_Extend_getEnabledDMAReceiveEvent        DL_UART_getEnabledDMAReceiveEvent
/*! Redirects to @ref DL_UART_getEnabledDMATransmitEvent */
#define DL_UART_Extend_getEnabledDMATransmitEvent       DL_UART_getEnabledDMATransmitEvent
/*! Redirects to @ref DL_UART_getEnabledDMAReceiveEventStatus */
#define DL_UART_Extend_getEnabledDMAReceiveEventStatus  DL_UART_getEnabledDMAReceiveEventStatus
/*! Redirects to @ref DL_UART_getEnabledDMATransmitEventStatus */
#define DL_UART_Extend_getEnabledDMATransmitEventStatus DL_UART_getEnabledDMATransmitEventStatus
/*! Redirects to @ref DL_UART_getRawDMAReceiveEventStatus */
#define DL_UART_Extend_getRawDMAReceiveEventStatus      DL_UART_getRawDMAReceiveEventStatus
/*! Redirects to @ref DL_UART_getRawDMATransmitEventStatus */
#define DL_UART_Extend_getRawDMATransmitEventStatus     DL_UART_getRawDMATransmitEventStatus
/*! Redirects to @ref DL_UART_setLINCounterValue */
#define DL_UART_Extend_setLINCounterValue               DL_UART_setLINCounterValue
/*! Redirects to @ref DL_UART_getLINCounterValue */
#define DL_UART_Extend_getLINCounterValue               DL_UART_getLINCounterValue
/*! Redirects to @ref DL_UART_enableLINCounter */
#define DL_UART_Extend_enableLINCounter                 DL_UART_enableLINCounter
/*! Redirects to @ref DL_UART_isLINCounterEnabled */
#define DL_UART_Extend_isLINCounterEnabled              DL_UART_isLINCounterEnabled
/*! Redirects to @ref DL_UART_disableLINCounter */
#define DL_UART_Extend_disableLINCounter                DL_UART_disableLINCounter
/*! Redirects to @ref DL_UART_enableLINCounterClearOnFallingEdge */
#define DL_UART_Extend_enableLINCounterClearOnFallingEdge DL_UART_enableLINCounterClearOnFallingEdge
/*! Redirects to @ref DL_UART_isLINCounterClearOnFallingEdge */
#define DL_UART_Extend_isLINCounterClearOnFallingEdge   DL_UART_isLINCounterClearOnFallingEdge
/*! Redirects to @ref DL_UART_disableLINCounterClearOnFallingEdge */
#define DL_UART_Extend_disableLINCounterClearOnFallingEdge DL_UART_disableLINCounterClearOnFallingEdge
/*! Redirects to @ref DL_UART_enableLINCountWhileLow */
#define DL_UART_Extend_enableLINCountWhileLow           DL_UART_enableLINCountWhileLow
/*! Redirects to @ref DL_UART_isLINCountWhileLowEnabled */
#define DL_UART_Extend_isLINCountWhileLowEnabled        DL_UART_isLINCountWhileLowEnabled
/*! Redirects to @ref DL_UART_disableLINCountWhileLow */
#define DL_UART_Extend_disableLINCountWhileLow          DL_UART_disableLINCountWhileLow
/*! Redirects to @ref DL_UART_enableLINFallingEdgeCapture */
#define DL_UART_Extend_enableLINFallingEdgeCapture      DL_UART_enableLINFallingEdgeCapture
/*! Redirects to @ref DL_UART_isLINFallingEdgeCaptureEnabled */
#define DL_UART_Extend_isLINFallingEdgeCaptureEnabled   DL_UART_isLINFallingEdgeCaptureEnabled
/*! Redirects to @ref DL_UART_disableLINFallingEdgeCapture */
#define DL_UART_Extend_disableLINFallingEdgeCapture     DL_UART_disableLINFallingEdgeCapture
/*! Redirects to @ref DL_UART_enableLINRisingEdgeCapture */
#define DL_UART_Extend_enableLINRisingEdgeCapture       DL_UART_enableLINRisingEdgeCapture
/*! Redirects to @ref DL_UART_isLINRisingEdgeCaptureEnabled */
#define DL_UART_Extend_isLINRisingEdgeCaptureEnabled    DL_UART_isLINRisingEdgeCaptureEnabled
/*! Redirects to @ref DL_UART_disableLINRisingEdgeCapture */
#define DL_UART_Extend_disableLINRisingEdgeCapture      DL_UART_disableLINRisingEdgeCapture
/*! Redirects to @ref DL_UART_enableLINCounterCompareMatch */
#define DL_UART_Extend_enableLINCounterCompareMatch     DL_UART_enableLINCounterCompareMatch
/*! Redirects to @ref DL_UART_enableLINSyncFieldValidationCounterControl */
#define DL_UART_Extend_enableLINSyncFieldValidationCounterControl DL_UART_enableLINSyncFieldValidationCounterControl
/*! Redirects to @ref DL_UART_enableLINReceptionCountControl */
#define DL_UART_Extend_enableLINReceptionCountControl   DL_UART_enableLINReceptionCountControl
/*! Redirects to @ref DL_UART_isLINCounterCompareMatchEnabled */
#define DL_UART_Extend_isLINCounterCompareMatchEnabled  DL_UART_isLINCounterCompareMatchEnabled
/*! Redirects to @ref DL_UART_disableLINCounterCompareMatch */
#define DL_UART_Extend_disableLINCounterCompareMatch    DL_UART_disableLINCounterCompareMatch
/*! Redirects to @ref DL_UART_setLINCounterCompareValue */
#define DL_UART_Extend_setLINCounterCompareValue        DL_UART_setLINCounterCompareValue
/*! Redirects to @ref DL_UART_getLINFallingEdgeCaptureValue */
#define DL_UART_Extend_getLINFallingEdgeCaptureValue    DL_UART_getLINFallingEdgeCaptureValue
/*! Redirects to @ref DL_UART_getLINRisingEdgeCaptureValue */
#define DL_UART_Extend_getLINRisingEdgeCaptureValue     DL_UART_getLINRisingEdgeCaptureValue
/*! Redirects to @ref DL_UART_enableLINSendBreak */
#define DL_UART_Extend_enableLINSendBreak               DL_UART_enableLINSendBreak
/*! Redirects to @ref DL_UART_disableLINSendBreak */
#define DL_UART_Extend_disableLINSendBreak              DL_UART_disableLINSendBreak
/*! Redirects to @ref DL_UART_isLINSendBreakEnabled */
#define DL_UART_Extend_isLINSendBreakEnabled            DL_UART_isLINSendBreakEnabled
/*! Redirects to @ref DL_UART_enableIrDAMode */
#define DL_UART_Extend_enableIrDAMode                   DL_UART_enableIrDAMode
/*! Redirects to @ref DL_UART_isIrDAModeEnabled */
#define DL_UART_Extend_isIrDAModeEnabled                DL_UART_isIrDAModeEnabled
/*! Redirects to @ref DL_UART_disableIrDAMode */
#define DL_UART_Extend_disableIrDAMode                  DL_UART_disableIrDAMode
/*! Redirects to @ref DL_UART_setIrDATXPulseClockSelect */
#define DL_UART_Extend_setIrDATXPulseClockSelect        DL_UART_setIrDATXPulseClockSelect
/*! Redirects to @ref DL_UART_getIrDATXPulseClockSelect */
#define DL_UART_Extend_getIrDATXPulseClockSelect        DL_UART_getIrDATXPulseClockSelect
/*! Redirects to @ref DL_UART_configIrDAMode */
#define DL_UART_Extend_configIrDAMode                   DL_UART_configIrDAMode
/*! Redirects to @ref DL_UART_setIrDAPulseLength */
#define DL_UART_Extend_setIrDAPulseLength               DL_UART_setIrDAPulseLength
/*! Redirects to @ref DL_UART_getIrDATXPulseLength */
#define DL_UART_Extend_getIrDATXPulseLength             DL_UART_getIrDATXPulseLength
/*! Redirects to @ref DL_UART_setIrDARXPulsePolarity */
#define DL_UART_Extend_setIrDARXPulsePolarity           DL_UART_setIrDARXPulsePolarity
/*! Redirects to @ref DL_UART_getIrDARXPulsePolarity */
#define DL_UART_Extend_getIrDARXPulsePolarity           DL_UART_getIrDARXPulsePolarity
/*! Redirects to @ref DL_UART_setDigitalPulseWidth */
#define DL_UART_Extend_setDigitalPulseWidth             DL_UART_setDigitalPulseWidth
/*! Redirects to @ref DL_UART_getDigitalPulseWidth */
#define DL_UART_Extend_getDigitalPulseWidth             DL_UART_getDigitalPulseWidth
/*! Redirects to @ref DL_UART_setAddressMask */
#define DL_UART_Extend_setAddressMask                   DL_UART_setAddressMask
/*! Redirects to @ref DL_UART_getAddressMask */
#define DL_UART_Extend_getAddressMask                   DL_UART_getAddressMask
/*! Redirects to @ref DL_UART_setAddress */
#define DL_UART_Extend_setAddress                       DL_UART_setAddress
/*! Redirects to @ref DL_UART_getAddress */
#define DL_UART_Extend_getAddress                       DL_UART_getAddress
/*! Redirects to @ref DL_UART_enableManchesterEncoding */
#define DL_UART_Extend_enableManchesterEncoding         DL_UART_enableManchesterEncoding
/*! Redirects to @ref DL_UART_disableManchesterEncoding */
#define DL_UART_Extend_disableManchesterEncoding        DL_UART_disableManchesterEncoding
/*! Redirects to @ref DL_UART_isManchesterEncodingEnabled */
#define DL_UART_Extend_isManchesterEncodingEnabled      DL_UART_isManchesterEncodingEnabled
/** @}*/

