neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_unicommuart.h
/*! @enum DL_UART_TX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when FIFO <= 3/4 empty */
    DL_UART_TX_FIFO_LEVEL_3_4_EMPTY = UNICOMMUART_IFLS_TXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when FIFO <= 1/2 empty */
    DL_UART_TX_FIFO_LEVEL_1_2_EMPTY = UNICOMMUART_IFLS_TXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when FIFO <= 1/4 empty */
    DL_UART_TX_FIFO_LEVEL_1_4_EMPTY = UNICOMMUART_IFLS_TXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when FIFO is not full */
    DL_UART_TX_FIFO_LEVEL_ONE_ENTRY = UNICOMMUART_IFLS_TXIFLSEL_LVL_NOT_FULL,
    /*! Interrupt triggers when FIFO is empty */
    DL_UART_TX_FIFO_LEVEL_EMPTY = UNICOMMUART_IFLS_TXIFLSEL_LVL_EMPTY,
    /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
    DL_UART_TX_FIFO_LEVEL_ALMOST_EMPTY = UNICOMMUART_IFLS_TXIFLSEL_LVL_ALMOST_EMPTY,
    /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
    DL_UART_TX_FIFO_LEVEL_ALMOST_FULL = UNICOMMUART_IFLS_TXIFLSEL_LVL_ALMOST_FULL
} DL_UART_TX_FIFO_LEVEL;

/*! @enum DL_UART_RX_FIFO_LEVEL */
typedef enum {
    /*! Interrupt triggers when FIFO >= 1/4 full */
    DL_UART_RX_FIFO_LEVEL_1_4_FULL = UNICOMMUART_IFLS_RXIFLSEL_LVL_1_4,
    /*! Interrupt triggers when FIFO >= 1/2 full */
    DL_UART_RX_FIFO_LEVEL_1_2_FULL = UNICOMMUART_IFLS_RXIFLSEL_LVL_1_2,
    /*! Interrupt triggers when FIFO >= 3/4 full */
    DL_UART_RX_FIFO_LEVEL_3_4_FULL = UNICOMMUART_IFLS_RXIFLSEL_LVL_3_4,
    /*! Interrupt triggers when FIFO is not empty */
    DL_UART_RX_FIFO_LEVEL_ONE_ENTRY = UNICOMMUART_IFLS_RXIFLSEL_LVL_NOT_EMPTY,
    /*! Interrupt triggers when FIFO is full */
    DL_UART_RX_FIFO_LEVEL_FULL = UNICOMMUART_IFLS_RXIFLSEL_LVL_FULL,
    /*! Interrupt triggers when FIFO is almost full (FIFO >= (MAX_FIFO_LEN - 1)) */
    DL_UART_RX_FIFO_LEVEL_ALMOST_FULL = UNICOMMUART_IFLS_RXIFLSEL_LVL_ALMOST_FULL,
    /*! Interrupt triggers when FIFO is almost empty (FIFO <= 1) */
    DL_UART_RX_FIFO_LEVEL_ALMOST_EMPTY = UNICOMMUART_IFLS_RXIFLSEL_LVL_ALMOST_EMPTY
} DL_UART_RX_FIFO_LEVEL;

/*! @enum DL_UART_IRDA_CLOCK */
typedef enum {
    /*! IrDA encode data is based on the Baud Rate clock */
    DL_UART_IRDA_CLOCK_BAUD_RATE = UNICOMMUART_IRCTL_IRTXCLK_BRCLK,
    /*! IrDA encode data is based on the Functional clock */
    DL_UART_IRDA_CLOCK_FUNCTIONAL = UNICOMMUART_IRCTL_IRTXCLK_BITCLK
} DL_UART_IRDA_CLOCK;

/*! @enum DL_UART_IRDA_POLARITY */
typedef enum {
    /*! IrDA transceiver delivers a low pulse when a light pulse is seen */
    DL_UART_IRDA_POLARITY_LOW = UNICOMMUART_IRCTL_IRRXPL_LOW,
    /*! IrDA transceiver delivers a high pulse when a light pulse is seen */
    DL_UART_IRDA_POLARITY_HIGH = UNICOMMUART_IRCTL_IRRXPL_HIGH
} DL_UART_IRDA_POLARITY;

/*!
 * @brief Sets the IrDA pulse width to 3/16 bit period when using the BITCLK16
 */
#define DL_UART_PULSE_WIDTH_3_16_BIT_PERIOD           ((uint32_t) 0x00000000U)

/* clang-format on */

/*!
 *  @brief  Configuration struct for @ref DL_UART_init
 */
typedef struct {
    /*! The communication mode and protocol used. One of @ref DL_UART_MODE */
    DL_UART_MODE mode;

    /*! The communication direction. One of @ref DL_UART_DIRECTION. */
    DL_UART_DIRECTION direction;

    /*! The flow control configuration. One of @ref DL_UART_FLOW_CONTROL */
    DL_UART_FLOW_CONTROL flowControl;

    /*! The parity configuration. One of @ref DL_UART_PARITY */
    DL_UART_PARITY parity;

    /*! The size of the data transfer. One of @ref DL_UART_WORD_LENGTH */
    DL_UART_WORD_LENGTH wordLength;

    /*! One of @ref DL_UART_STOP_BITS  */
    DL_UART_STOP_BITS stopBits;

} DL_UART_Config;

/*!
 *  @brief  Configuration struct for @ref DL_UART_setClockConfig.
 */
typedef struct {
    /*! Selects uart module clock source @ref DL_UART_CLOCK */
    DL_UART_CLOCK clockSel;

    /*! Selects the divide ratio. One of @ref DL_UART_CLOCK_DIVIDE_RATIO */
    DL_UART_CLOCK_DIVIDE_RATIO divideRatio;

} DL_UART_ClockConfig;

/**
 * @brief Configuration structure to backup UART Extend peripheral state before
 *        going to STOP/STANDBY mode. Used by
 *        @ref DL_UART_saveConfiguration and
 *        @ref DL_UART_restoreConfiguration
 */
typedef struct {
    /*! Combination of basic UART control configurations that are
     *  compressed to a single word as they are stored in the UNICOMMUART
     *  registers. See @ref DL_UART_init for how the peripheral control word
     *  is created. */
    uint32_t controlWord;

    /*! UART module clock source. One of  @ref DL_UART_CLOCK */
    uint32_t clockSel;

    /*! UART clock divider. One of @ref DL_UART_CLOCK_DIVIDE_RATIO */
    uint32_t divideRatio;

    /*! Combination of UART Line Control Register configurations that are
     *  compressed to a single word as they are stored in the UNICOMMUART
     *  registers. See @ref DL_UART_init for how the peripheral control word
     *  is created. */
    uint32_t lineControlRegisterWord;

    /*! Combination of UART interrupt FIFO level select configurations that are
     *  compressed to a single word as they are stored in the UNICOMMUART
     * registers. */
    uint32_t interruptFifoLevelSelectWord;

    /*! UART integer baud rate divisor. Value between 0 - 65535. */
    uint32_t ibrd;

    /*! UART fractional baud rate divisor. Value between 0 - 63. */
    uint32_t fbrd;

    /*! Combination of UART glitch filter configurations that are
     *  compressed to a single word as they are stored in the UNICOMMUART
     *  registers. */
    uint32_t glitchFilterControlWord;

    /*! Combination of UART LIN basic configurations that are
     *  compressed to a single word as they are stored in the UNICOMMUART
     *  registers. */
    uint32_t linControlWord;

    /*! Combination of UART IrDA basic configurations that are
     *  compressed to a single word as they are stored in the UNICOMMUART
     *  registers. */
    uint32_t irdaControlWord;

    /*! UART address mask for 9-bit or Idle mode. */
    uint32_t addressMask;

    /*! UART address that should be matched for 9-bit or Idle mode. */
    uint32_t address;

    /*! UART interrupt status for EVENT0.
     * Bitwise OR of @ref DL_UART_INTERRUPT */
    uint32_t interruptMask0;

