neon-smart-studio/W-Link_NeonRTOS_Platform/src/Drivers/soc/MSPM0/driverlib/dl_unicommuart.h
    return (DL_UART_TX_FIFO_LEVEL)(threshold);
}

/**
 *  @brief      Set the RX FIFO interrupt threshold level. The interrupts are
 *  generated based on a transition through a level rather than being based on
 *  the level. That is, the interrupts are generated when the fill level
 *  progresses through the trigger level. For example, if the receive trigger
 *  level is set to the half-way mark, the interrupt is triggered when the
 *  receive FIFO becomes half full. In other words, the interrupt is triggered
 *  after the receive FIFO is filled with two or more characters.
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
 *  @param[in]  threshold  One of @ref DL_UART_RX_FIFO_LEVEL
 */
__STATIC_INLINE void DL_UART_setRXFIFOThreshold(
    UNICOMM_Inst_Regs *unicomm, DL_UART_RX_FIFO_LEVEL threshold)
{
    DL_Common_updateReg(&unicomm->uart->IFLS, (uint32_t) threshold,
        UNICOMMUART_IFLS_RXIFLSEL_MASK);
}

/**
 *  @brief      Get the RX FIFO interrupt threshold level
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The RX FIFO interrupt threshold level
 *
 *  @retval     One of @ref DL_UART_RX_FIFO_LEVEL
 */
__STATIC_INLINE DL_UART_RX_FIFO_LEVEL DL_UART_getRXFIFOThreshold(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t threshold = unicomm->uart->IFLS & UNICOMMUART_IFLS_RXIFLSEL_MASK;

    return (DL_UART_RX_FIFO_LEVEL)(threshold);
}

/**
 *  @brief      Set the RX interrupt timeout
 *
 *  When an additional character has not been received within the set
 *  timeout, a RX interrupt will still trigger even if the FIFO level has not
 *  been reached. A value of 0 disables this function.
 *
 *  @param[in]  unicomm     Pointer to the register overlay for the peripheral
 *  @param[in]  timeout  Timeout to set the RX interrupt to.
 *                       Value between 0 - 15
 */
__STATIC_INLINE void DL_UART_setRXInterruptTimeout(
    UNICOMM_Inst_Regs *unicomm, uint32_t timeout)
{
    DL_Common_updateReg(&unicomm->uart->IFLS,
        timeout << UNICOMMUART_IFLS_RXTOSEL_OFS,
        UNICOMMUART_IFLS_RXTOSEL_MASK);
}

/**
 *  @brief      Get the RX interrupt timeout
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The RX interrupt timeout value
 *
 *  @retval     0 - 15  The RX interrupt timeout value
 *
 */
__STATIC_INLINE uint32_t DL_UART_getRXInterruptTimeout(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->IFLS & UNICOMMUART_IFLS_RXTOSEL_MASK) >>
            UNICOMMUART_IFLS_RXTOSEL_OFS);
}

/**
 *  @brief      Get Integer Baud-Rate Divisor
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The integer component of the baud rate divisor
 *
 *  @retval     0 - 65535 The integer baud date divisor
 */
__STATIC_INLINE uint32_t DL_UART_getIntegerBaudRateDivisor(
    UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->uart->IBRD & UNICOMMUART_IBRD_DIVINT_MASK);
}

/**
 *  @brief      Get Fractional Baud-Rate Divisor
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The fractional component of the baud rate divisor
 *
 *  @retval     0 - 63  The fractional baud date divisor
 */
__STATIC_INLINE uint32_t DL_UART_getFractionalBaudRateDivisor(
    UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->uart->FBRD & UNICOMMUART_FBRD_DIVFRAC_MASK);
}

/**
 *  @brief      Set the baud rate divisor
 *
 *  Set the integer baud rate divisor and fractional baud rate divisor
 *  components of the baud rate divisor
 *
 *  @param[in]  unicomm               Pointer to the register overlay for the
 *                                 peripheral
 *  @param[in]  integerDivisor     The integer component of the baud rate
 *                                 divisor
 *  @param[in]  fractionalDivisor  The fractional component of the baud rate
 *                                 divisor
 */
__STATIC_INLINE void DL_UART_setBaudRateDivisor(UNICOMM_Inst_Regs *unicomm,
    uint32_t integerDivisor, uint32_t fractionalDivisor)
{
    DL_Common_updateReg(
        &unicomm->uart->IBRD, integerDivisor, UNICOMMUART_IBRD_DIVINT_MASK);
    DL_Common_updateReg(&unicomm->uart->FBRD, fractionalDivisor,
        UNICOMMUART_FBRD_DIVFRAC_MASK);

    // When updating the baud-rate divisor (UNICOMMUARTIBRD or UNICOMMUARTIFRD),
    // the LCRH register must also be written to (any bit in LCRH can
    // be written to for updating the baud-rate divisor).
    DL_Common_updateReg(&unicomm->uart->LCRH,
        (unicomm->uart->LCRH & UNICOMMUART_LCRH_BRK_MASK),
        UNICOMMUART_LCRH_BRK_MASK);
}

/**
 *  @brief      Set the pulse width select for the digital glitch suppresion
 *
 *  Controls the pulse width select for glitch suppression on the RX line.
 *  The glitch suppression values are in terms of functional clocks.
 *
 *  In IrDA mode, this sets the receive filter length. The minimum pulse
 *  length for receive is given by: t(MIN) = (DGFSEL) / f(IRTXCLK)
 *
 *  @param[in]  unicomm        Pointer to the register overlay for the peripheral
 *  @param[in]  pulseWidth  Pulse width select for the glitch suppresion.
 *                          Value between 0 - 63.
 */
__STATIC_INLINE void DL_UART_setDigitalPulseWidth(
    UNICOMM_Inst_Regs *unicomm, uint32_t pulseWidth)
{
    DL_Common_updateReg(
        &unicomm->uart->GFCTL, pulseWidth, UNICOMMUART_GFCTL_DGFSEL_MASK);
}

/**
 *  @brief      Get the pulse width select for the digital glitch suppresion
 *
 *  Gets the pulse width select for glitch suppression on the RX line.
 *  The glitch suppression values are in terms of functional clocks.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The digital glitch suppression pulse width
 *
 *  @retval     0 indicating digital glitch suppression is disabled
 *  @retval     1 - 63 the digital glitch suppression pulse width
 */
__STATIC_INLINE uint32_t DL_UART_getDigitalPulseWidth(
    UNICOMM_Inst_Regs *unicomm)
{
    return (unicomm->uart->GFCTL & UNICOMMUART_GFCTL_DGFSEL_MASK);
}

/**
 *  @brief      Writes data into the TX FIFO to transmit
 *
 *  Puts the data into the TX FIFO without checking it's status. Use if already
 *  sure the TX FIFO has space for the write. See related APIs for additional
 *  transmit options.
 *
 *  For transmitted data, if the FIFO is enabled, data written to this
 *  location is pushed onto the transmit FIFO. If the FIFO is disabled,
 *  data is stored in the 1-byte deep transmitter.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *  @param[in]  data  The data to transmit
 *
 *
 *  @sa         DL_UART_transmitDataBlocking
 *  @sa         DL_UART_transmitDataCheck
 */
__STATIC_INLINE void DL_UART_transmitData(
    UNICOMM_Inst_Regs *unicomm, uint8_t data)
{
    unicomm->uart->TXDATA = data;
}

/**
 *  @brief      Reads data from the RX FIFO
 *
 *  Reads the data from the RX FIFO without checking its status. Use if
 *  already sure the RX FIFO has data available. See related APIs for
 *  additional receive options.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The data in the RX FIFO
 *
 *  @sa         DL_UART_receiveDataBlocking
 *  @sa         DL_UART_receiveDataCheck
 */
__STATIC_INLINE uint8_t DL_UART_receiveData(UNICOMM_Inst_Regs *unicomm)
{
    return ((uint8_t)(unicomm->uart->RXDATA & UNICOMMUART_RXDATA_DATA_MASK));
}

/**
 *  @brief      Gets the status of the error flags of the received data
 *
 *  @param[in]  unicomm       Pointer to the register overlay for the peripheral
 *  @param[in]  errorMask  Bit mask of error flags to check. Bitwise OR of
 *                         @ref DL_UART_ERROR.
 *
 *  @return     The status of the requested UART error flags
 *
 *  @retval     Bitwise OR of @ref DL_UART_ERROR values
 */
__STATIC_INLINE uint32_t DL_UART_getErrorStatus(
    UNICOMM_Inst_Regs *unicomm, uint32_t errorMask)
{
    return (unicomm->uart->RXDATA & errorMask);
}

/**
 *  @brief      Set the LIN counter value
 *
 *  The LIN counter is a 16 bit up counter clocked by the functional clock of
 *  the UNICOMMUART
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *  @param[in]  value  Pulse width select for the glitch suppresion.
 */
__STATIC_INLINE void DL_UART_setLINCounterValue(
    UNICOMM_Inst_Regs *unicomm, uint16_t value)
{
    DL_Common_updateReg(
        &unicomm->uart->LINCNT, value, UNICOMMUART_LINCNT_VALUE_MASK);
}

/**
 *  @brief      Get the LIN counter value
 *
 *  The LIN counter is a 16 bit up counter clocked by the module clock of
 *  the UNICOMMUART
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The clock counter value
 *
 *  @retval     0 - 65535  The clock counter value
 *
 */
__STATIC_INLINE uint16_t DL_UART_getLINCounterValue(UNICOMM_Inst_Regs *unicomm)
{
    return ((uint16_t)(unicomm->uart->LINCNT & UNICOMMUART_LINCNT_VALUE_MASK));
}

/**
 *  @brief      Enable the LIN counter
 *
 *  The LIN counter will only count when enabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableLINCounter(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL |= UNICOMMUART_LINCTL_CTRENA_ENABLE;
}

/**
 *  @brief      Check if the LIN counter is enabled
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of the LIN counter
 *
 *  @retval     true   LIN counter is enabled
 *  @retval     false  LIN counter is disabled
 */
__STATIC_INLINE bool DL_UART_isLINCounterEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->LINCTL & UNICOMMUART_LINCTL_CTRENA_MASK) ==
            UNICOMMUART_LINCTL_CTRENA_ENABLE);
}

/**
 *  @brief      Disable the LIN counter
 *
 *  LIN counter will only count when enabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINCounter(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL &= ~(UNICOMMUART_LINCTL_CTRENA_MASK);
}

/**
 *  @brief   Enable LIN counter clear and start counting on falling edge of RXD
 *
 *  When enabled, the counter is set to 0 and starts counting on the LIN counter
 *  on a falling edge of RXD.
 *
 *  The LIN counter will only count when it is enabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @sa  DL_UART_enableLINCounter
 */
__STATIC_INLINE void DL_UART_enableLINCounterClearOnFallingEdge(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL |= UNICOMMUART_LINCTL_ZERONE_ENABLE;
}

/**
 *  @brief      Check if LIN counting on falling edge of RXD is enabled
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of counting on falling edge of RXD
 *
 *  @retval     true   Counting on falling edge is enabled
 *  @retval     false  Counting on falling edge is disabled
 */
__STATIC_INLINE bool DL_UART_isLINCounterClearOnFallingEdge(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->LINCTL & UNICOMMUART_LINCTL_ZERONE_MASK) ==
            UNICOMMUART_LINCTL_ZERONE_ENABLE);
}

/**
 *  @brief      Disable LIN counting on falling edge of RXD
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINCounterClearOnFallingEdge(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL &= ~(UNICOMMUART_LINCTL_ZERONE_MASK);
}

/**
 *  @brief      Enable LIN counter incrementing while RXD signal is low
 *
 *  When LIN counter is enabled and the signal on RXD is low, the counter
 *  increments
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @sa  DL_UART_enableLINCounter
 */
__STATIC_INLINE void DL_UART_enableLINCountWhileLow(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL |= UNICOMMUART_LINCTL_CNTRXLOW_ENABLE;
}

/**
 *  @brief   Check if LIN counter increments while RXD signal is low is enabled
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of counter increments while RXD signal is low
 *
 *  @retval     true   Counter increments while RXD signal is low is enabled
 *  @retval     false  Counter increments while RXD signal is low is disabled
 */
__STATIC_INLINE bool DL_UART_isLINCountWhileLowEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->LINCTL & UNICOMMUART_LINCTL_CNTRXLOW_MASK) ==
            UNICOMMUART_LINCTL_CNTRXLOW_ENABLE);
}

/**
 *  @brief      Disable LIN counter increments while RXD signal is low
 *
 *  LIN counter will not increment while the RXD signal is low
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINCountWhileLow(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL &= ~(UNICOMMUART_LINCTL_CNTRXLOW_MASK);
}

/**
 *  @brief      Enable capture of the LIN counter on a falling edge
 *
 *  When enabled, the LIN counter value is captured to the LINC0 register on
 *  each falling RXD edge. A LINC0 interrupt is triggered when enabled.
 *  Disables counter compare match mode if enabled.
 *
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @sa  DL_UART_configLINMode
 */
__STATIC_INLINE void DL_UART_enableLINFallingEdgeCapture(
    UNICOMM_Inst_Regs *unicomm)
{
    DL_Common_updateReg(&unicomm->uart->LINCTL,
        UNICOMMUART_LINCTL_LINC0CAP_ENABLE |
            UNICOMMUART_LINCTL_LINC0_MATCH_DISABLE,
        UNICOMMUART_LINCTL_LINC0CAP_MASK |
            UNICOMMUART_LINCTL_LINC0_MATCH_MASK);
}

/**
 *  @brief      Check status of capture of LIN counter on a falling edge
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of capture the LIN counter on a falling edge
 *
 *  @retval     true   Capture to LINC0 on falling RXD edge is enabled
 *  @retval     false  Capture to LINC0 on falling RXD edge is disabled
 */
__STATIC_INLINE bool DL_UART_isLINFallingEdgeCaptureEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->LINCTL & UNICOMMUART_LINCTL_LINC0CAP_MASK) ==
            UNICOMMUART_LINCTL_LINC0CAP_ENABLE);
}

/**
 *  @brief      Disable capture of LIN counter on a falling edge
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINFallingEdgeCapture(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL &= ~(UNICOMMUART_LINCTL_LINC0CAP_MASK);
}

/**
 *  @brief      Enable capture of the LIN counter on a rising edge
 *
 *  When enabled the LIN counter value is captured to LINC1 register on each
 *  rising RXD edge. A LINC1 interrupt is triggered when enabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 */
__STATIC_INLINE void DL_UART_enableLINRisingEdgeCapture(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL |= UNICOMMUART_LINCTL_LINC1CAP_ENABLE;
}

/**
 *  @brief      Check status of capture of LIN counter on a rising edge
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of capture of LIN counter on a rising edge
 *
 *  @retval     true   Capture to LINC1 on rising RXD edge is enabled
 *  @retval     false  Capture to LINC1 on rising RXD edge is disabled
 */
__STATIC_INLINE bool DL_UART_isLINRisingEdgeCaptureEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->LINCTL & UNICOMMUART_LINCTL_LINC1CAP_MASK) ==
            UNICOMMUART_LINCTL_LINC1CAP_ENABLE);
}

/**
 *  @brief      Disable capture of LIN counter on a rising edge
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINRisingEdgeCapture(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL &= ~(UNICOMMUART_LINCTL_LINC1CAP_MASK);
}

/**
 *  @brief      Enable LIN counter compare match mode
 *
 *  When enabled, a match between a value in LINC0 and the LIN counter can
 *  trigger a LINC0 interrupt. Disables capture on falling edge if enabled.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableLINCounterCompareMatch(
    UNICOMM_Inst_Regs *unicomm)
{
    DL_Common_updateReg(&unicomm->uart->LINCTL,
        UNICOMMUART_LINCTL_LINC0_MATCH_ENABLE |
            UNICOMMUART_LINCTL_LINC0CAP_DISABLE,
        UNICOMMUART_LINCTL_LINC0CAP_MASK |
            UNICOMMUART_LINCTL_LINC0_MATCH_MASK);
}

/**
 *  @brief      Setup LIN counter control for sync field validation
 *
 *  Enable LIN counter capture on rising RX edge. Enable LIN counter capture on falling RX edge.
 *  Enable LIN counter clearing on RX falling edge. Enable LIN counter.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableLINSyncFieldValidationCounterControl(
    UNICOMM_Inst_Regs *unicomm)
{
    DL_Common_updateReg(&unicomm->uart->LINCTL,
        UNICOMMUART_LINCTL_LINC0CAP_ENABLE |
            UNICOMMUART_LINCTL_LINC1CAP_ENABLE |
            UNICOMMUART_LINCTL_ZERONE_ENABLE |
            UNICOMMUART_LINCTL_CTRENA_ENABLE,
        UNICOMMUART_LINCTL_LINC0CAP_MASK | UNICOMMUART_LINCTL_LINC1CAP_MASK |
            UNICOMMUART_LINCTL_ZERONE_MASK | UNICOMMUART_LINCTL_CTRENA_MASK);
}

/**
 *  @brief      Setup LIN counter control for LIN reception
 *
 * Enable count while low signal on RXD. Enable LIN counter clearing on RXD falling edge.
 * Enable LIN counter.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableLINReceptionCountControl(
    UNICOMM_Inst_Regs *unicomm)
{
    DL_Common_updateReg(&unicomm->uart->LINCTL,
        UNICOMMUART_LINCTL_CNTRXLOW_ENABLE | UNICOMMUART_LINCTL_ZERONE_ENABLE |
            UNICOMMUART_LINCTL_CTRENA_ENABLE,
        UNICOMMUART_LINCTL_CNTRXLOW_MASK | UNICOMMUART_LINCTL_ZERONE_MASK |
            UNICOMMUART_LINCTL_CTRENA_MASK);
}

/**
 *  @brief      Check if LIN counter compare match mode is enabled
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of counter compare match mode
 *
 *  @retval     true   LIN counter compare match mode is enabled
 *  @retval     false  LIN counter compare match mode is disabled
 */
__STATIC_INLINE bool DL_UART_isLINCounterCompareMatchEnabled(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->LINCTL & UNICOMMUART_LINCTL_LINC0_MATCH_MASK) ==
            UNICOMMUART_LINCTL_LINC0_MATCH_ENABLE);
}

/**
 *  @brief      Disable LIN counter compare match mode
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableLINCounterCompareMatch(
    UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->LINCTL &= ~(UNICOMMUART_LINCTL_LINC0_MATCH_MASK);
}

/**
 *  @brief      Set the value to be compared to the LIN counter
 *
 *  Sets the value of LINC0 to be used to compare to the LIN counter. For use
 *  when LIN counter compare match mode is enabled.
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *  @param[in]  value  Value to be compared to the LIN counter for matching.
 *                     Value between 0 - 65535.
 *
 *  @sa  DL_UART_enableLINCounterCompareMatch
 */
__STATIC_INLINE void DL_UART_setLINCounterCompareValue(
    UNICOMM_Inst_Regs *unicomm, uint16_t value)
{
    DL_Common_updateReg(
        &unicomm->uart->LINC0, value, UNICOMMUART_LINC0_DATA_MASK);
}

/**
 *  @brief      Get the LINC0 counter value
 *
 *  Captures current LINCTR value on RXD falling edge.
 *
 *  If capture is enabled with @ref DL_UART_enableLINFallingEdgeCapture, a
 *  capture can generate a LINC0 interrupt.
 *  If compare mode is enabled with @ref DL_UART_enableLINCounterCompareMatch,
 *  a counter match can generate a LINC0 interrupt.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The LINC0 counter value
 *
 *  @retval     0 - 65535  The LINC0 counter value
 *
 *  @sa  DL_UART_enableLINFallingEdgeCapture
 *  @sa  DL_UART_enableLINCounterCompareMatch
 */
__STATIC_INLINE uint16_t DL_UART_getLINFallingEdgeCaptureValue(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((uint16_t)(unicomm->uart->LINC0 & UNICOMMUART_LINC0_DATA_MASK));
}

/**
 *  @brief      Get the LINC1 counter value
 *
 *  Captures current LINCTR value on RXD rising edge. For use when LIN rising
 *  edge capture is enabled. It can generate a LINC1 interrupt on capture.
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The LINC1 counter value
 *
 *  @retval     0 - 65535  The LINC1 counter value
 *
 *  @sa  DL_UART_enableLINRisingEdgeCapture
 */
__STATIC_INLINE uint16_t DL_UART_getLINRisingEdgeCaptureValue(
    UNICOMM_Inst_Regs *unicomm)
{
    return ((uint16_t)(unicomm->uart->LINC1 & UNICOMMUART_LINC1_DATA_MASK));
}

/**
 *  @brief      Enable the IrDA encoder/decoder
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_enableIrDAMode(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->IRCTL |= UNICOMMUART_IRCTL_IREN_ENABLE;
}

/**
 *  @brief      Check if the IrDA encoder/decoder is enabled
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The status of IrDA mode
 *
 *  @retval     true   IrDA mode is enabled
 *  @retval     false  IrDA mode is disabled
 */
__STATIC_INLINE bool DL_UART_isIrDAModeEnabled(UNICOMM_Inst_Regs *unicomm)
{
    return ((unicomm->uart->IRCTL & UNICOMMUART_IRCTL_IREN_MASK) ==
            UNICOMMUART_IRCTL_IREN_ENABLE);
}

/**
 *  @brief      Disable the IrDA encoder/decoder
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 */
__STATIC_INLINE void DL_UART_disableIrDAMode(UNICOMM_Inst_Regs *unicomm)
{
    unicomm->uart->IRCTL &= ~(UNICOMMUART_IRCTL_IREN_MASK);
}

/**
 *  @brief      Set the IrDA transmit pulse clock select
 *
 *  @param[in]  unicomm   Pointer to the register overlay for the peripheral
 *  @param[in]  uartClock  The clock select for the IrDA pulse data to be based on.
 *                     One of @ref DL_UART_IRDA_CLOCK
 */
__STATIC_INLINE void DL_UART_setIrDATXPulseClockSelect(
    UNICOMM_Inst_Regs *unicomm, DL_UART_IRDA_CLOCK uartClock)
{
    DL_Common_updateReg(&unicomm->uart->IRCTL, (uint32_t) uartClock,
        UNICOMMUART_IRCTL_IRTXCLK_MASK);
}

/**
 *  @brief      Get the IrDA transmit pulse clock select
 *
 *  @param[in]  unicomm  Pointer to the register overlay for the peripheral
 *
 *  @return     The clock select that the IrDA pulse data is based on
 *
 *  @retval     One of @ref DL_UART_IRDA_CLOCK
 *
 */
__STATIC_INLINE DL_UART_IRDA_CLOCK DL_UART_getIrDATXPulseClockSelect(
    UNICOMM_Inst_Regs *unicomm)
{
    uint32_t uartClock = unicomm->uart->IRCTL & UNICOMMUART_IRCTL_IRTXCLK_MASK;

    return (DL_UART_IRDA_CLOCK)(uartClock);
}

/**
 *  @brief      Set the IrDA configurations
 *
 *  Calculates the baud rate divisor given the clock output of the UART clock
 *  source and the target baud rate. This API also enables IrDA mode.
 *
 *  @param[in]  unicomm         Pointer to the register overlay for the peripheral
 *  @param[in]  polarity     The receive input polarity.
 *                           One of @ref DL_UART_IRDA_POLARITY.
 *  @param[in]  pulseLength  The length of the IrDA transmit pulse.
 *  @param[in]  irdaClk      The clock used for the transmit pulse.
 *                           One of @ref DL_UART_IRDA_CLOCK.
 */
void DL_UART_configIrDAMode(UNICOMM_Inst_Regs *unicomm,
    DL_UART_IRDA_POLARITY polarity, uint32_t pulseLength,
    DL_UART_IRDA_CLOCK irdaClk);

